In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("data1.csv")

### To know information about the dataframe, use info()

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 169 entries, 0 to 168
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  169 non-null    int64
 1   Pulse     169 non-null    int64
 2   Maxpulse  169 non-null    int64
 3   Calories  164 non-null    float64
dtypes: float64(1), int64(3)
memory usage: 5.4 KB

### To know the statistical analysis of your data, use describe()
   * count
   * mean
   * max
   * min
   * standard deviation

In [4]:
df.describe()

         Duration       Pulse    Maxpulse     Calories
count  169.000000  169.000000  169.000000   164.000000
mean    63.846154  107.461538  134.047337   375.790244
std     42.299949   14.510259   16.450434   266.379919
min     15.000000   80.000000  100.000000    50.300000
25%     45.000000  100.000000  124.000000   250.925000
50%     60.000000  105.000000  131.000000   318.600000
75%     60.000000  111.000000  141.000000   387.600000
max    300.000000  159.000000  184.000000  1860.400000

### To get the first 5 rows, use head()

In [43]:
df.head()

   Duration  Pulse  Maxpulse  Calories
0        20     83       107      50.3
1        15     80       100      50.5
2        20     95       112      77.7
3        30     92       108      92.7
4        30     90       120      86.2

### To get the last 5 rows, use tail()

In [44]:
df.tail()

   Duration  Pulse  Maxpulse  Calories
0        20     83       107      50.3
1        15     80       100      50.5
2        20     95       112      77.7
3        30     92       108      92.7
4        30     90       120      86.2

### To get to know the shape of the data, use shape

In [45]:
df.shape

(5, 4)

### To retrieve the specific rows from the dataframe, use loc[]

In [46]:
df.loc[0] # To get the first row

Duration     20.0
Pulse        83.0
Maxpulse    107.0
Calories     50.3
Name: 0, dtype: float64

### To get rows upto the limit, use iloc[]

In [9]:
df.iloc[0:10]

   Duration  Pulse  Maxpulse  Calories
0        60    110       130     409.1
1        60    117       145     479.0
2        60    103       135     340.0
3        45    109       175     282.4
4        45    117       148     406.0
5        60    102       127     300.0
6        60    110       136     374.0
7        45    104       134     253.3
8        30    109       133     195.1
9        60     98       124     269.0

### Want to change the dataframe that contains null values 
  * use dropna() to remove null values,
  * but it doesn't change the data in original dataframe object
  * if you want change the original dataframe use dropna(inplace=True)

In [10]:
df.dropna()

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[164 rows x 4 columns]

### To replace empty values use
   * fillna() 
   * To fill values for specified columns just specify the coloumn name
   * To replace empty values either we use mean() or median() or mode()

In [11]:
df.fillna(130,inplace=True)

In [12]:
x = df['Calories'].mean()
df['Calories'].fillna(x,inplace=True)

### To check for any null values in data
   * Use isnull(), It will return in boolean form if true null values is present
   * sum() to check how many null values are there

In [13]:
df.isnull().sum()

Duration    0
Pulse       0
Maxpulse    0
Calories    0
dtype: int64

In [38]:
# dropping all the rows which contains Calories more than 120
for i in df.index:
    if df.loc[i,'Calories'] >120:
        df.drop(i,inplace=True)

In [36]:
df.drop(['index','level_0'],axis=1,inplace=True)

In [37]:
df

   Duration  Pulse  Maxpulse  Calories
0        20     83       107      50.3
1        15     80       100      50.5
2        20     95       112      77.7
3        30     92       108      92.7
4        30     90       120      86.2

### To check wheather data has duplicate records or not, use duplicated()

In [40]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
dtype: bool

### To remove duplicates, use drop_duplicates()

In [41]:
df.drop_duplicates(inplace=True)

   Duration  Pulse  Maxpulse  Calories
0        20     83       107      50.3
1        15     80       100      50.5
2        20     95       112      77.7
3        30     92       108      92.7
4        30     90       120      86.2